In [65]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from warnings import filterwarnings
filterwarnings('ignore')

In [66]:
df = pd.read_csv(r'D:\data science\taitanic\ChangeByName.csv')

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   PassengerId              891 non-null    int64
 1   Survived                 891 non-null    int64
 2   Pclass                   891 non-null    int64
 3   Name                     891 non-null    object
 4   Sex                      891 non-null    object
 5   Age                      714 non-null    float64
 6   SibSp                    891 non-null    int64
 7   Parch                    891 non-null    int64
 8   Ticket                   891 non-null    object
 9   Fare                     891 non-null    float64
 10  Cabin                    204 non-null    object
 11  Embarked                 889 non-null    object
 12  Gender Status from Name  891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [68]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Gender Status from Name
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,2.839506
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,1.444886
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,1.000000
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,4.000000
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,4.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,4.000000

In [69]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Gender Status from Name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,4
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,4

In [70]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Gender Status from Name
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,1
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C,4
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,4

In [71]:
df.isnull().sum()

PassengerId                  0
Survived                     0
Pclass                       0
Name                         0
Sex                          0
Age                        177
SibSp                        0
Parch                        0
Ticket                       0
Fare                         0
Cabin                      687
Embarked                     2
Gender Status from Name      0
dtype: int64

In [72]:
df.loc[~df['Cabin'].isin([np.nan]),'Cabin'] = 1

In [73]:
df.loc[df['Cabin'].isin([np.nan]),'Cabin'] = 0

In [74]:
df['Cabin'].value_counts()

0    687
1    204
Name: Cabin, dtype: int64

In [75]:
df_objects = df.select_dtypes(include = 'object')

In [76]:
df_objects.columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [77]:
df[(df['Embarked']=='C')]['Survived'].value_counts()

1    93
0    75
Name: Survived, dtype: int64

In [78]:
df[(df['Embarked']=='Q')]['Survived'].value_counts()

0    47
1    30
Name: Survived, dtype: int64

In [79]:
df[(df['Embarked']=='S')]['Survived'].value_counts()

0    427
1    217
Name: Survived, dtype: int64

In [80]:
df.loc[df['Embarked'].isin(['S']),'Embarked'] = 3

In [81]:
df.loc[df['Embarked'].isin(['Q']),'Embarked'] = 2

In [82]:
df.loc[df['Embarked'].isin(['C']),'Embarked'] = 1

In [83]:
df.loc[df['Embarked'].isin([np.nan]),'Embarked'] = 1

In [84]:
#df['Embarked'] = df['Embarked'].fillna(1)
#df = pd.get_dummies(df, columns = ['Embarked'], drop_first= True)

In [85]:
df['Gender Status from Name'].value_counts()

4    518
1    180
2    130
0     57
3      6
Name: Gender Status from Name, dtype: int64

In [86]:
for i in range(0,5):
    df.loc[(df['Age'].isin([np.nan])) & (df['Gender Status from Name']==i),'Age'] = df[df['Gender Status from Name']==i]['Age'].mean()

In [87]:
df.isnull().sum()

PassengerId                0
Survived                   0
Pclass                     0
Name                       0
Sex                        0
Age                        0
SibSp                      0
Parch                      0
Ticket                     0
Fare                       0
Cabin                      0
Embarked                   0
Gender Status from Name    0
dtype: int64

In [88]:
df = df.drop(['Ticket','Name','PassengerId','Gender Status from Name'],axis=1)

In [89]:
df['Cabin'] = df['Cabin'].astype(int)
df['Embarked'] = df['Embarked'].astype(int)

In [90]:
df['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [91]:
df['Parch'].value_counts()

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

In [92]:
df['Family'] = df['Parch'] + df['SibSp']

In [93]:
df = df.drop(['Parch','SibSp'],axis=1)

In [94]:
from sklearn.preprocessing import LabelEncoder
LE_Sex = LabelEncoder()
df['Sex'] = LE_Sex.fit_transform(df['Sex'])

In [95]:
X = df.drop(['Survived'],axis=1)
Y = df['Survived']

In [96]:
from sklearn.preprocessing import MinMaxScaler
MMS = MinMaxScaler() 
X_N = MMS.fit_transform(X)
X_N = pd.DataFrame(X_N, columns = X.columns)

In [97]:
X_N.to_csv('D:\data science\data\cleandata.csv', index = False)